## Python Homework Pyboss
### Loading Data in

In [252]:
import pandas as pd 
employee1=pd.read_csv('employee_data1.csv',sep=',')
employee2=pd.read_csv('employee_data2.csv',sep=',')

In [253]:
employee=pd.concat([employee1,employee2])

In [254]:
employee.head()

   Emp ID           Name         DOB          SSN         State
0     214  Sarah Simpson  1985-12-04  282-01-8166       Florida
1      15  Samantha Lara  1993-09-08  848-80-7526      Colorado
2     411  Stacy Charles  1957-12-20  658-75-8526  Pennsylvania
3     166   Michelle Roy  1978-07-29  794-25-3944      Michigan
4      39  Joseph Rogers  1985-03-28  525-40-3515     Minnesota

### Splitting Name column into First and Last name

In [255]:
df = employee['Name'].apply(lambda x: pd.Series(x.split(' ')))

In [256]:
df.columns=['First Name','Last Name']
employee=pd.concat([employee,df],axis=1)
del employee['Name']
employee.head()

   Emp ID         DOB          SSN         State First Name Last Name
0     214  1985-12-04  282-01-8166       Florida      Sarah   Simpson
1      15  1993-09-08  848-80-7526      Colorado   Samantha      Lara
2     411  1957-12-20  658-75-8526  Pennsylvania      Stacy   Charles
3     166  1978-07-29  794-25-3944      Michigan   Michelle       Roy
4      39  1985-03-28  525-40-3515     Minnesota     Joseph    Rogers

### Reformatting DOB Column

In [257]:
list_DOB=[]
for x in employee['DOB']:
    Day=x[-2:]
    Month=x[-5:-3]
    Year=x[0:4]
    list_DOB.append(str(Day)+'/'+str(Month)+'/'+str(Year))

In [258]:
list_DOB2=pd.DataFrame(list_DOB)
employee2=pd.DataFrame(employee)
employee2.head()

   Emp ID         DOB          SSN         State First Name Last Name
0     214  1985-12-04  282-01-8166       Florida      Sarah   Simpson
1      15  1993-09-08  848-80-7526      Colorado   Samantha      Lara
2     411  1957-12-20  658-75-8526  Pennsylvania      Stacy   Charles
3     166  1978-07-29  794-25-3944      Michigan   Michelle       Roy
4      39  1985-03-28  525-40-3515     Minnesota     Joseph    Rogers

In [259]:
Employee2=employee2[['Emp ID','DOB','SSN','State','First Name','Last Name']]

In [260]:
Employee2=Employee2.reset_index()
df2=pd.concat([Employee2,list_DOB2],axis=1)
df2=df2.rename(columns={0:"DOB2"})

In [261]:
del df2['index']
del df2['DOB']
df2.head()

   Emp ID          SSN         State First Name Last Name        DOB2
0     214  282-01-8166       Florida      Sarah   Simpson  04/12/1985
1      15  848-80-7526      Colorado   Samantha      Lara  08/09/1993
2     411  658-75-8526  Pennsylvania      Stacy   Charles  20/12/1957
3     166  794-25-3944      Michigan   Michelle       Roy  29/07/1978
4      39  525-40-3515     Minnesota     Joseph    Rogers  28/03/1985

### Reformating SSN Column

In [262]:
list_SSN=[]
for x in df2['SSN']:
    last4=x[-4:]
    list_SSN.append('***-**-'+str(last4))

In [263]:
list_SSN2=pd.DataFrame(list_SSN)

In [264]:
df2=pd.concat([df2,list_SSN2],axis=1)

In [265]:
df2=df2.rename(columns={0:"SSN2"})
del df2['SSN']
df2.head()

   Emp ID         State First Name Last Name        DOB2         SSN2
0     214       Florida      Sarah   Simpson  04/12/1985  ***-**-8166
1      15      Colorado   Samantha      Lara  08/09/1993  ***-**-7526
2     411  Pennsylvania      Stacy   Charles  20/12/1957  ***-**-8526
3     166      Michigan   Michelle       Roy  29/07/1978  ***-**-3944
4      39     Minnesota     Joseph    Rogers  28/03/1985  ***-**-3515

### Reformatting State Column

In [266]:
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}

In [267]:
list_state=[]
for x in df2['State']:
    abb=us_state_abbrev[x]
    list_state.append(abb)

In [268]:
list_state2=pd.DataFrame(list_state)

In [269]:
df2=pd.concat([df2,list_state2],axis=1)

In [270]:
df2=df2.rename(columns={0:"State2"})
del df2['State']
df2.head()

   Emp ID First Name Last Name        DOB2         SSN2 State2
0     214      Sarah   Simpson  04/12/1985  ***-**-8166     FL
1      15   Samantha      Lara  08/09/1993  ***-**-7526     CO
2     411      Stacy   Charles  20/12/1957  ***-**-8526     PA
3     166   Michelle       Roy  29/07/1978  ***-**-3944     MI
4      39     Joseph    Rogers  28/03/1985  ***-**-3515     MN